---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.LegendFailures.LegendComponentBadViewType
source: html/889c2520-dd5a-8752-e9fe-8f1bc5c17eee.htm
---
# Autodesk.Revit.DB.BuiltInFailures.LegendFailures.LegendComponentBadViewType Property

Legend Components may only be placed in Legends

## Syntax (C#)
```csharp
public static FailureDefinitionId LegendComponentBadViewType { get; }
```